In [53]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [63]:
train=pd.read_csv("train_clean.csv")
test=pd.read_csv("test_clean.csv")

In [64]:
train.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title,Family_Size
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,Mr,1
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,Mrs,1
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,Miss,0
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,Mrs,1
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,Mr,0

In [65]:
train.drop(['Cabin','Name','Ticket'],axis=1,inplace=True)
test.drop(['Cabin','Name','Ticket'],axis=1,inplace=True)

In [66]:
train.isnull().sum()

Age            0
Embarked       0
Fare           0
Parch          0
PassengerId    0
Pclass         0
Sex            0
SibSp          0
Survived       0
Title          0
Family_Size    0
dtype: int64

In [74]:
set_x=train[['Age','Embarked','Fare','Pclass','Sex','Parch','SibSp','Family_Size']]
set_y=train[['Survived']]

In [75]:
set_x.head()

    Age Embarked     Fare  Pclass     Sex  Parch  SibSp  Family_Size
0  22.0        S   7.2500       3    male      0      1            1
1  38.0        C  71.2833       1  female      0      1            1
2  26.0        S   7.9250       3  female      0      0            0
3  35.0        S  53.1000       1  female      0      1            1
4  35.0        S   8.0500       3    male      0      0            0

In [76]:
dummies_Gender=pd.get_dummies(set_x['Sex'])
set_x=pd.concat([set_x,dummies_Gender],axis="columns")
set_x.drop(['Sex'],axis="columns",inplace=True)

dummies_embarked=pd.get_dummies(set_x['Embarked'])
set_x=pd.concat([set_x,dummies_embarked],axis="columns")
set_x.drop(['Embarked'],axis="columns",inplace=True)

In [77]:
set_x.head()

    Age     Fare  Pclass  Parch  SibSp  Family_Size  female  male  C  Q  S
0  22.0   7.2500       3      0      1            1       0     1  0  0  1
1  38.0  71.2833       1      0      1            1       1     0  1  0  0
2  26.0   7.9250       3      0      0            0       1     0  0  0  1
3  35.0  53.1000       1      0      1            1       1     0  0  0  1
4  35.0   8.0500       3      0      0            0       0     1  0  0  1

In [78]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(set_x, set_y, test_size=0.30, random_state=42)

In [87]:
from sklearn.linear_model import LogisticRegression
model=LogisticRegression(solver='newton-cg')
model.fit(X_train,y_train)

Survived=model.predict(X_test)
model.score(X_test,y_test)

C:\Users\HP\Anaconda3\lib\site-packages\sklearn\utils\validation.py:724: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

0.8134328358208955

In [81]:
from sklearn import tree
model1=tree.DecisionTreeClassifier()
model1.fit(X_train,y_train)

model1.score(X_test,y_test)

0.7313432835820896

In [83]:
from sklearn.svm import SVC
obj=SVC()
obj.fit(X_train,y_train)

obj.score(X_test,y_test)

C:\Users\HP\Anaconda3\lib\site-packages\sklearn\utils\validation.py:724: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\HP\Anaconda3\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

0.7201492537313433

In [96]:
from sklearn.neural_network import MLPClassifier
clf = MLPClassifier(solver='adam')
clf.fit(X_train, y_train)
predictions=clf.predict(X_test)

C:\Users\HP\Anaconda3\lib\site-packages\sklearn\neural_network\multilayer_perceptron.py:921: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [97]:
clf.score(X_test,y_test)

0.7985074626865671

In [100]:
#neural network

from sklearn.metrics import classification_report,confusion_matrix
print(confusion_matrix(y_test,predictions))
print(classification_report(y_test,predictions))

[[133  24]
 [ 30  81]]
              precision    recall  f1-score   support

         0.0       0.82      0.85      0.83       157
         1.0       0.77      0.73      0.75       111

    accuracy                           0.80       268
   macro avg       0.79      0.79      0.79       268
weighted avg       0.80      0.80      0.80       268

In [101]:
#logistic regression

from sklearn.metrics import classification_report,confusion_matrix
print(confusion_matrix(y_test,Survived))
print(classification_report(y_test,Survived))

[[137  20]
 [ 30  81]]
              precision    recall  f1-score   support

         0.0       0.82      0.87      0.85       157
         1.0       0.80      0.73      0.76       111

    accuracy                           0.81       268
   macro avg       0.81      0.80      0.80       268
weighted avg       0.81      0.81      0.81       268

In [104]:
#best result of .81 and .80 F1 scores are received from LOGISTIC REGRESSION 
#and MLP CLASSIFIER -neural networks

In [105]:
###(important)
#https://www.kaggle.com/jamesleslie/titanic-neural-network-for-beginners